use crate::{和了::待ち牌, 牌::牌};

#[test]
fn test_通常形_wildcard待ち牌_true() {
    let 手牌 = unsafe {
        [
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 三筒#2 */ 牌::from_id(0b01_0011_10),
            /* 三筒#3 */ 牌::from_id(0b01_0011_11),
            /* 四筒#0 */ 牌::from_id(0b01_0100_00),
            /* 五筒#0 */ 牌::from_id(0b01_0101_00),
            /* 六筒#0 */ 牌::from_id(0b01_0110_00),
            /* 七筒#0 */ 牌::from_id(0b01_0111_00),
            /* 八筒#0 */ 牌::from_id(0b01_1000_00),
            /* 九筒#0 */ 牌::from_id(0b01_1001_00),
            /* 九筒#1 */ 牌::from_id(0b01_1001_01),
            /* 九筒#2 */ 牌::from_id(0b01_1001_10),
            /* 中#2 */ 牌::from_id(0b11_1111_10),
        ]
    };
    assert_eq!(
        format!(
            "{:?}",
            待ち牌(
                &手牌,
                0b10
            )),
        "[4萬#2, 4萬#3, 1筒#0, 1筒#1, 1筒#2, 1筒#3, 2筒#0, 2筒#1, 2筒#2, 2筒#3, 3筒#0, 3筒#1, 4筒#1, 4筒#2, 4筒#3, 5筒#1, 5筒#2, 5筒#3, 6筒#1, 6筒#2, 6筒#3, 9筒#3, 中#0, 中#1, 中#3]"
    );
}
