use crate::{和了::通常形::is通常形, 牌::牌};

#[test]
fn test_通常形_wildcard四萬_true() {
    unsafe {
        assert!(is通常形(&[
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 四萬#2 */ 牌::from_id(0b00_0100_10),
            /* 三筒#2 */ 牌::from_id(0b01_0011_10),
            /* 三筒#3 */ 牌::from_id(0b01_0011_11),
            /* 四筒#0 */ 牌::from_id(0b01_0100_00),
            /* 五筒#0 */ 牌::from_id(0b01_0101_00),
            /* 六筒#0 */ 牌::from_id(0b01_0110_00),
            /* 七筒#0 */ 牌::from_id(0b01_0111_00),
            /* 八筒#0 */ 牌::from_id(0b01_1000_00),
            /* 九筒#0 */ 牌::from_id(0b01_1001_00),
            /* 九筒#1 */ 牌::from_id(0b01_1001_01),
            /* 九筒#2 */ 牌::from_id(0b01_1001_10),
            /* 中#2 */ 牌::from_id(0b11_1111_10),
        ]));
    }
}

#[test]
fn test_通常形_wildcard一筒_true() {
    unsafe {
        assert!(is通常形(&[
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 一筒#2 */ 牌::from_id(0b01_0001_10),
            /* 三筒#2 */ 牌::from_id(0b01_0011_10),
            /* 三筒#3 */ 牌::from_id(0b01_0011_11),
            /* 四筒#0 */ 牌::from_id(0b01_0100_00),
            /* 五筒#0 */ 牌::from_id(0b01_0101_00),
            /* 六筒#0 */ 牌::from_id(0b01_0110_00),
            /* 七筒#0 */ 牌::from_id(0b01_0111_00),
            /* 八筒#0 */ 牌::from_id(0b01_1000_00),
            /* 九筒#0 */ 牌::from_id(0b01_1001_00),
            /* 九筒#1 */ 牌::from_id(0b01_1001_01),
            /* 九筒#2 */ 牌::from_id(0b01_1001_10),
            /* 中#2 */ 牌::from_id(0b11_1111_10),
        ]));
    }
}


#[test]
fn test_通常形_wildcard二筒_true() {
    unsafe {
        assert!(is通常形(&[
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 二筒#2 */ 牌::from_id(0b01_0010_10),
            /* 三筒#2 */ 牌::from_id(0b01_0011_10),
            /* 三筒#3 */ 牌::from_id(0b01_0011_11),
            /* 四筒#0 */ 牌::from_id(0b01_0100_00),
            /* 五筒#0 */ 牌::from_id(0b01_0101_00),
            /* 六筒#0 */ 牌::from_id(0b01_0110_00),
            /* 七筒#0 */ 牌::from_id(0b01_0111_00),
            /* 八筒#0 */ 牌::from_id(0b01_1000_00),
            /* 九筒#0 */ 牌::from_id(0b01_1001_00),
            /* 九筒#1 */ 牌::from_id(0b01_1001_01),
            /* 九筒#2 */ 牌::from_id(0b01_1001_10),
            /* 中#2 */ 牌::from_id(0b11_1111_10),
        ]));
    }
}


#[test]
fn test_通常形_wildcard三筒_true() {
    unsafe {
        assert!(is通常形(&[
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 三筒#1 */ 牌::from_id(0b01_0011_01),
            /* 三筒#2 */ 牌::from_id(0b01_0011_10),
            /* 三筒#3 */ 牌::from_id(0b01_0011_11),
            /* 四筒#0 */ 牌::from_id(0b01_0100_00),
            /* 五筒#0 */ 牌::from_id(0b01_0101_00),
            /* 六筒#0 */ 牌::from_id(0b01_0110_00),
            /* 七筒#0 */ 牌::from_id(0b01_0111_00),
            /* 八筒#0 */ 牌::from_id(0b01_1000_00),
            /* 九筒#0 */ 牌::from_id(0b01_1001_00),
            /* 九筒#1 */ 牌::from_id(0b01_1001_01),
            /* 九筒#2 */ 牌::from_id(0b01_1001_10),
            /* 中#2 */ 牌::from_id(0b11_1111_10),
        ]));
    }
}


#[test]
fn test_通常形_wildcard四筒_true() {
    unsafe {
        assert!(is通常形(&[
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 三筒#2 */ 牌::from_id(0b01_0011_10),
            /* 三筒#3 */ 牌::from_id(0b01_0011_11),
            /* 四筒#0 */ 牌::from_id(0b01_0100_00),
            /* 四筒#2 */ 牌::from_id(0b01_0100_10),
            /* 五筒#0 */ 牌::from_id(0b01_0101_00),
            /* 六筒#0 */ 牌::from_id(0b01_0110_00),
            /* 七筒#0 */ 牌::from_id(0b01_0111_00),
            /* 八筒#0 */ 牌::from_id(0b01_1000_00),
            /* 九筒#0 */ 牌::from_id(0b01_1001_00),
            /* 九筒#1 */ 牌::from_id(0b01_1001_01),
            /* 九筒#2 */ 牌::from_id(0b01_1001_10),
            /* 中#2 */ 牌::from_id(0b11_1111_10),
        ]));
    }
}


#[test]
fn test_通常形_wildcard五筒_true() {
    unsafe {
        assert!(is通常形(&[
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 三筒#2 */ 牌::from_id(0b01_0011_10),
            /* 三筒#3 */ 牌::from_id(0b01_0011_11),
            /* 四筒#2 */ 牌::from_id(0b01_0100_10),
            /* 五筒#0 */ 牌::from_id(0b01_0101_00),
            /* 五筒#3 */ 牌::from_id(0b01_0101_11),
            /* 六筒#0 */ 牌::from_id(0b01_0110_00),
            /* 七筒#0 */ 牌::from_id(0b01_0111_00),
            /* 八筒#0 */ 牌::from_id(0b01_1000_00),
            /* 九筒#0 */ 牌::from_id(0b01_1001_00),
            /* 九筒#1 */ 牌::from_id(0b01_1001_01),
            /* 九筒#2 */ 牌::from_id(0b01_1001_10),
            /* 中#2 */ 牌::from_id(0b11_1111_10),
        ]));
    }
}


#[test]
fn test_通常形_wildcard六筒_true() {
    unsafe {
        assert!(is通常形(&[
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 三筒#2 */ 牌::from_id(0b01_0011_10),
            /* 三筒#3 */ 牌::from_id(0b01_0011_11),
            /* 四筒#2 */ 牌::from_id(0b01_0100_10),
            /* 五筒#0 */ 牌::from_id(0b01_0101_00),
            /* 六筒#0 */ 牌::from_id(0b01_0110_00),
            /* 六筒#3 */ 牌::from_id(0b01_0110_11),
            /* 七筒#0 */ 牌::from_id(0b01_0111_00),
            /* 八筒#0 */ 牌::from_id(0b01_1000_00),
            /* 九筒#0 */ 牌::from_id(0b01_1001_00),
            /* 九筒#1 */ 牌::from_id(0b01_1001_01),
            /* 九筒#2 */ 牌::from_id(0b01_1001_10),
            /* 中#2 */ 牌::from_id(0b11_1111_10),
        ]));
    }
}


#[test]
fn test_通常形_wildcard九筒_true() {
    unsafe {
        assert!(is通常形(&[
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 三筒#2 */ 牌::from_id(0b01_0011_10),
            /* 三筒#3 */ 牌::from_id(0b01_0011_11),
            /* 四筒#2 */ 牌::from_id(0b01_0100_10),
            /* 五筒#0 */ 牌::from_id(0b01_0101_00),
            /* 六筒#0 */ 牌::from_id(0b01_0110_00),
            /* 七筒#0 */ 牌::from_id(0b01_0111_00),
            /* 八筒#0 */ 牌::from_id(0b01_1000_00),
            /* 九筒#0 */ 牌::from_id(0b01_1001_00),
            /* 九筒#1 */ 牌::from_id(0b01_1001_01),
            /* 九筒#2 */ 牌::from_id(0b01_1001_10),
            /* 九筒#3 */ 牌::from_id(0b01_1001_11),
            /* 中#2 */ 牌::from_id(0b11_1111_10),
        ]));
    }
}
