use crate::和了::通常形::is通常形;
use crate::牌::牌;

#[test]
fn test_通常形_九蓮1_true() {
    unsafe {
        assert!(is通常形(&[
            /* 一萬#0 */ 牌::from_id(0b00_0001_00),
            /* 一萬#1 */ 牌::from_id(0b00_0001_01),
            /* 一萬#2 */ 牌::from_id(0b00_0001_10),
            /* 一萬#3 */ 牌::from_id(0b00_0001_11),
            /* 二萬#0 */ 牌::from_id(0b00_0010_00),
            /* 三萬#0 */ 牌::from_id(0b00_0011_00),
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 五萬#0 */ 牌::from_id(0b00_0101_00),
            /* 六萬#0 */ 牌::from_id(0b00_0110_00),
            /* 七萬#0 */ 牌::from_id(0b00_0111_00),
            /* 八萬#0 */ 牌::from_id(0b00_1000_00),
            /* 九萬#0 */ 牌::from_id(0b00_1001_00),
            /* 九萬#1 */ 牌::from_id(0b00_1001_01),
            /* 九萬#2 */ 牌::from_id(0b00_1001_10),
        ]));
    }
}

#[test]
fn test_通常形_九蓮2_true() {
    unsafe {
        assert!(is通常形(&[
            /* 一萬#0 */ 牌::from_id(0b00_0001_00),
            /* 一萬#1 */ 牌::from_id(0b00_0001_01),
            /* 一萬#2 */ 牌::from_id(0b00_0001_10),
            /* 二萬#0 */ 牌::from_id(0b00_0010_00),
            /* 二萬#1 */ 牌::from_id(0b00_0010_01),
            /* 三萬#0 */ 牌::from_id(0b00_0011_00),
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 五萬#0 */ 牌::from_id(0b00_0101_00),
            /* 六萬#0 */ 牌::from_id(0b00_0110_00),
            /* 七萬#0 */ 牌::from_id(0b00_0111_00),
            /* 八萬#0 */ 牌::from_id(0b00_1000_00),
            /* 九萬#0 */ 牌::from_id(0b00_1001_00),
            /* 九萬#1 */ 牌::from_id(0b00_1001_01),
            /* 九萬#2 */ 牌::from_id(0b00_1001_10),
        ]));
    }
}

#[test]
fn test_通常形_九蓮3_true() {
    unsafe {
        assert!(is通常形(&[
            /* 一萬#0 */ 牌::from_id(0b00_0001_00),
            /* 一萬#1 */ 牌::from_id(0b00_0001_01),
            /* 一萬#2 */ 牌::from_id(0b00_0001_10),
            /* 二萬#0 */ 牌::from_id(0b00_0010_00),
            /* 三萬#0 */ 牌::from_id(0b00_0011_00),
            /* 三萬#1 */ 牌::from_id(0b00_0011_01),
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 五萬#0 */ 牌::from_id(0b00_0101_00),
            /* 六萬#0 */ 牌::from_id(0b00_0110_00),
            /* 七萬#0 */ 牌::from_id(0b00_0111_00),
            /* 八萬#0 */ 牌::from_id(0b00_1000_00),
            /* 九萬#0 */ 牌::from_id(0b00_1001_00),
            /* 九萬#1 */ 牌::from_id(0b00_1001_01),
            /* 九萬#2 */ 牌::from_id(0b00_1001_10),
        ]));
    }
}

#[test]
fn test_通常形_九蓮4_true() {
    unsafe {
        assert!(is通常形(&[
            /* 一萬#0 */ 牌::from_id(0b00_0001_00),
            /* 一萬#1 */ 牌::from_id(0b00_0001_01),
            /* 一萬#2 */ 牌::from_id(0b00_0001_10),
            /* 二萬#0 */ 牌::from_id(0b00_0010_00),
            /* 三萬#0 */ 牌::from_id(0b00_0011_00),
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 四萬#1 */ 牌::from_id(0b00_0100_01),
            /* 五萬#0 */ 牌::from_id(0b00_0101_00),
            /* 六萬#0 */ 牌::from_id(0b00_0110_00),
            /* 七萬#0 */ 牌::from_id(0b00_0111_00),
            /* 八萬#0 */ 牌::from_id(0b00_1000_00),
            /* 九萬#0 */ 牌::from_id(0b00_1001_00),
            /* 九萬#1 */ 牌::from_id(0b00_1001_01),
            /* 九萬#2 */ 牌::from_id(0b00_1001_10),
        ]));
    }
}

#[test]
fn test_通常形_九蓮5_true() {
    unsafe {
        assert!(is通常形(&[
            /* 一萬#0 */ 牌::from_id(0b00_0001_00),
            /* 一萬#1 */ 牌::from_id(0b00_0001_01),
            /* 一萬#2 */ 牌::from_id(0b00_0001_10),
            /* 二萬#0 */ 牌::from_id(0b00_0010_00),
            /* 三萬#0 */ 牌::from_id(0b00_0011_00),
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 五萬#0 */ 牌::from_id(0b00_0101_00),
            /* 五萬#1 */ 牌::from_id(0b00_0101_01),
            /* 六萬#0 */ 牌::from_id(0b00_0110_00),
            /* 七萬#0 */ 牌::from_id(0b00_0111_00),
            /* 八萬#0 */ 牌::from_id(0b00_1000_00),
            /* 九萬#0 */ 牌::from_id(0b00_1001_00),
            /* 九萬#1 */ 牌::from_id(0b00_1001_01),
            /* 九萬#2 */ 牌::from_id(0b00_1001_10),
        ]));
    }
}

#[test]
fn test_通常形_九蓮6_true() {
    unsafe {
        assert!(is通常形(&[
            /* 一萬#0 */ 牌::from_id(0b00_0001_00),
            /* 一萬#1 */ 牌::from_id(0b00_0001_01),
            /* 一萬#2 */ 牌::from_id(0b00_0001_10),
            /* 二萬#0 */ 牌::from_id(0b00_0010_00),
            /* 三萬#0 */ 牌::from_id(0b00_0011_00),
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 五萬#0 */ 牌::from_id(0b00_0101_00),
            /* 六萬#0 */ 牌::from_id(0b00_0110_00),
            /* 六萬#1 */ 牌::from_id(0b00_0110_01),
            /* 七萬#0 */ 牌::from_id(0b00_0111_00),
            /* 八萬#0 */ 牌::from_id(0b00_1000_00),
            /* 九萬#0 */ 牌::from_id(0b00_1001_00),
            /* 九萬#1 */ 牌::from_id(0b00_1001_01),
            /* 九萬#2 */ 牌::from_id(0b00_1001_10),
        ]));
    }
}

#[test]
fn test_通常形_九蓮7_true() {
    unsafe {
        assert!(is通常形(&[
            /* 一萬#0 */ 牌::from_id(0b00_0001_00),
            /* 一萬#1 */ 牌::from_id(0b00_0001_01),
            /* 一萬#2 */ 牌::from_id(0b00_0001_10),
            /* 二萬#0 */ 牌::from_id(0b00_0010_00),
            /* 三萬#0 */ 牌::from_id(0b00_0011_00),
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 五萬#0 */ 牌::from_id(0b00_0101_00),
            /* 六萬#0 */ 牌::from_id(0b00_0110_00),
            /* 七萬#0 */ 牌::from_id(0b00_0111_00),
            /* 七萬#1 */ 牌::from_id(0b00_0111_01),
            /* 八萬#0 */ 牌::from_id(0b00_1000_00),
            /* 九萬#0 */ 牌::from_id(0b00_1001_00),
            /* 九萬#1 */ 牌::from_id(0b00_1001_01),
            /* 九萬#2 */ 牌::from_id(0b00_1001_10),
        ]));
    }
}

#[test]
fn test_通常形_九蓮8_true() {
    unsafe {
        assert!(is通常形(&[
            /* 一萬#0 */ 牌::from_id(0b00_0001_00),
            /* 一萬#1 */ 牌::from_id(0b00_0001_01),
            /* 一萬#2 */ 牌::from_id(0b00_0001_10),
            /* 二萬#0 */ 牌::from_id(0b00_0010_00),
            /* 三萬#0 */ 牌::from_id(0b00_0011_00),
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 五萬#0 */ 牌::from_id(0b00_0101_00),
            /* 六萬#0 */ 牌::from_id(0b00_0110_00),
            /* 七萬#0 */ 牌::from_id(0b00_0111_00),
            /* 八萬#0 */ 牌::from_id(0b00_1000_00),
            /* 八萬#1 */ 牌::from_id(0b00_1000_01),
            /* 九萬#0 */ 牌::from_id(0b00_1001_00),
            /* 九萬#1 */ 牌::from_id(0b00_1001_01),
            /* 九萬#2 */ 牌::from_id(0b00_1001_10),
        ]));
    }
}

#[test]
fn test_通常形_九蓮9_true() {
    unsafe {
        assert!(is通常形(&[
            /* 一萬#0 */ 牌::from_id(0b00_0001_00),
            /* 一萬#1 */ 牌::from_id(0b00_0001_01),
            /* 一萬#2 */ 牌::from_id(0b00_0001_10),
            /* 二萬#0 */ 牌::from_id(0b00_0010_00),
            /* 三萬#0 */ 牌::from_id(0b00_0011_00),
            /* 四萬#0 */ 牌::from_id(0b00_0100_00),
            /* 五萬#0 */ 牌::from_id(0b00_0101_00),
            /* 六萬#0 */ 牌::from_id(0b00_0110_00),
            /* 七萬#0 */ 牌::from_id(0b00_0111_00),
            /* 八萬#0 */ 牌::from_id(0b00_1000_00),
            /* 九萬#0 */ 牌::from_id(0b00_1001_00),
            /* 九萬#1 */ 牌::from_id(0b00_1001_01),
            /* 九萬#2 */ 牌::from_id(0b00_1001_10),
            /* 九萬#3 */ 牌::from_id(0b00_1001_11),
        ]));
    }
}
